report/report.tex
% Created 2022-04-12 Tue 08:05
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{190022658}
\date{\today}
\title{CS3101 - P2 Report}
\hypersetup{
 pdfauthor={190022658},
 pdftitle={CS3101 - P2 Report},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.1 (Org mode 9.5)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{Usage}
\label{sec:orgc7b130f}
The practical is built using MariaDB, JavaScript, NodeJS, Express and HTML.

To run the node server follow the steps below
\begin{itemize}
\item set PORT environment variable as your uid
\item npm i
\item npm run setup
\item mysql -h <hostname> -u <username> -p <database-name> < src/database/func.sql
\item mysql -h <hostname> -u <username> -p <database-name> < src/database/views.sql
\item npm start
\end{itemize}

\textbf{NOTE:} the sequence is important as views.sql depends on func.sql.

\section{Overview}
\label{sec:org1b12d76}
This practical touched upon all aspects of database design and I have completed all of the basic functionality.
\begin{itemize}
\item Created a MariaDB database
\item Added tables
\item Uploaded sample data
\item Created Views and a Function
\item Enforced all the basic constrains
\item Created a procedure
\item Designed a backend which connects the database to a front end
\end{itemize}
\section{Database Implementation}
\label{sec:orgdbe751b}
\subsection{Tables}
\label{sec:org42eeef7}
The only things to be noticed are the use of DELETE CASCADE. The constrains were also set at the same time.
\subsection{Views}
\label{sec:org539458b}
There was a need for join to form views. I also made a helper sql function called winner. To assist with finding out the number of wins a person has. \emph{view\_contact\_details} uses two system defined functions. I was lucky enough to find GROUP\_CONCAT() which combined all the phone number to help me get the desired output.
\subsection{Queries}
\label{sec:orgc1a25bb}
Queries were used in views, function, procedures and also the backend. There was one slightly complicated one where we had to show match details but had to display the names instead of the email. There was two joins necessary to do that as there were two players in the relation. Each of there were given a different identifier to distinguish between them.
\subsection{Functions}
\label{sec:orgfcc5a21}
This was one of the two harder things in this practical along with the procedure. While there might be other better ways to find out the winner using match\_id, this is what I came up with. It utilizes declare, count and case to do that.
\subsection{Procedures}
\label{sec:org7c8f1d6}
The procedure was to insert and update data. The difference with functions was clear with the SET keyword. Here, I first declared the variables that I would have to use later. I found LAST\_INSERT\_ID() after some research which allows me to get the last id that was inserted that I needed as a foreign key for played\_set. There were two players but (with the help of winner()) we only kney who won. So using a CASE, I found out the one primary key for player and update it's elo according to the formula given.
\section{GUI Implementation}
\label{sec:org543f576}
The GUI is HTML combined with JavaScript. It is a very simple layout without styling. There is a main page ('/') which connects to the two basic requirements ('/venue.html' and '/player.html'). The venue page lets you see who and when are playing in specific locations in a simple table. The player page allows you to add players via a form which has very basic validation.
\end{document}
